In [1]:
import pandas as pd

In [2]:
a=pd.Series(["Sita","Rita","Ram","Hari"])
b=pd.Series([1000,2500,4000,2200])

In [3]:
df=pd.DataFrame({"Name":a,"Salary":b})

In [4]:
df

   Name  Salary
0  Sita    1000
1  Rita    2500
2   Ram    4000
3  Hari    2200